In [89]:
#pandas piplelines 

# ------------------------------------------------------------------------------
# Pandas Series Overview
# ------------------------------------------------------------------------------
# A Pandas Series is a one-dimensional labeled array capable of holding any data type.
# It is similar to a column in a spreadsheet or database table.
#
# Example:
# import pandas as pd
# s = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
#
# Features:
# - Labeled Indexing:
#     You can access elements by custom labels (e.g., s['b'] gives 200).
# - Vectorized Operations:
#     Supports operations like s + 10 or s * 2 applied to each element.
# - Data Types:
#     Can hold integers, floats, strings, or even Python objects.
# - Dictionary Input:
#     Series can be created from a dictionary, where keys become index labels.
#     Example: pd.Series({'a': 10, 'b': 20})
#
# Use Cases:
# - When you need a single labeled column of data.
# - Acts as a building block for DataFrames (which are 2D structures).
# ------------------------------------------------------------------------------

In [90]:
#Creating Series using list

import pandas as pd

pd.Series(['Male','Female','Male','Male','Female','Female','Female'])

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

In [91]:
#creating list using array
import numpy as np
ser=pd.Series(np.array(['Male','Female','Male','Male','Female','Female','Female']))
print(type(ser))
print(ser)

<class 'pandas.core.series.Series'>
0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

In [92]:
#creating series using dictionary

#key is used as the index and value=value
dict_data={'a':1,'b':2,'c':3}
ser1=pd.Series(dict_data)
print(ser1)
print()
print(ser1.index)
print(ser1.values)

a    1
b    2
c    3
dtype: int64

Index(['a', 'b', 'c'], dtype='object')
[1 2 3]

<h1>Dataframe

In [93]:
# ------------------------------------------------------------------------------
# Pandas DataFrame Overview
# ------------------------------------------------------------------------------
# A Pandas DataFrame is a 2-dimensional, labeled data structure similar to a table,
# spreadsheet, or SQL result set.
#
# Structure:
# - It consists of rows and columns.
# - Each column is essentially a Pandas Series.
# - Columns can hold different data types (int, float, string, etc.).
#
# Example:
# import pandas as pd
# data = {
#     'Name': ['Alice', 'Bob', 'Charlie'],
#     'Age': [25, 30, 22],
#     'City': ['New York', 'London', 'Paris']
# }
# df = pd.DataFrame(data)
#
# Common Operations:
# - df['Age']           -> Access a column (returns a Series)
# - df.loc[1]           -> Access row by label
# - df.iloc[1]          -> Access row by position
# - df['Age'].mean()    -> Calculate average of Age column
#
# Use Cases:
# - Storing and analyzing structured data
# - Importing/exporting data from CSV, Excel, SQL, etc.
# - Performing data cleaning, filtering, aggregation, and visualization
# ------------------------------------------------------------------------------

In [94]:
df=pd.DataFrame({'Name':["alyster","alvin","alex","tanay"],
              'Age':[23,24,25,26],
              'Sex': ["MALE","MALE","MALE","MALE"]})
print(df)

      Name  Age   Sex
0  alyster   23  MALE
1    alvin   24  MALE
2     alex   25  MALE
3    tanay   26  MALE

In [95]:
#extracting single column from the dataframe(i.e printing series)
print(df['Name'])
print()
print(df['Name'][2])

0    alyster
1      alvin
2       alex
3      tanay
Name: Name, dtype: object

alex

In [96]:
#dataframe when column name is not specified
#since column name is not specified , it apprears as Range Index object
pd.DataFrame([[123,456,789],[213,565,852],['akl','bsg','cfg']])

     0    1    2
0  123  456  789
1  213  565  852
2  akl  bsg  cfg

#series operations

In [97]:
eyes=pd.Series({'hazel':200,'blue':45,'green':789})
print(eyes)

hazel    200
blue      45
green    789
dtype: int64

In [98]:
#attributes of Series object
print(eyes.index)
eyes.name='eye_color'
print(eyes.name)


print(eyes.values)

print()
print(eyes.sort_values)
print(eyes.sort_index)

print(eyes.unique())
print(eyes.nunique())

Index(['hazel', 'blue', 'green'], dtype='object')
eye_color
[200  45 789]

<bound method Series.sort_values of hazel    200
blue      45
green    789
Name: eye_color, dtype: int64>
<bound method Series.sort_index of hazel    200
blue      45
green    789
Name: eye_color, dtype: int64>
[200  45 789]
3

In [99]:
#duplicate values

my_data2=[220,215,93,64,64]
eye2=pd.Series(data=my_data2,index=['brown','blue','blue','hazel','green'])
print(eye2)

brown    220
blue     215
blue      93
hazel     64
green     64
dtype: int64

In [100]:
eye2.unique()

array([220, 215,  93,  64], dtype=int64)

In [101]:
eye2.value_counts()

64     2
220    1
215    1
93     1
Name: count, dtype: int64

In [102]:
eye2.index

Index(['brown', 'blue', 'blue', 'hazel', 'green'], dtype='object')

In [103]:
eye2.nunique()

4

In [104]:
#Series can be indexed and sliced like numpy arrays
ser3=pd.Series([1,5,9,8,7,4,6,3,5,7,8],index=['a','b','c','d','e','f','g','h','i','j','k'])


print(ser3['d']) #value at index d
print()
print(ser3[1:4]) #values from index 1 to 4

8

b    5
c    9
d    8
dtype: int64

In [105]:
#Series Operations:
# - Arithmetic operations (addition, subtraction, etc.) are vectorized.
# - You can perform operations on Series with different lengths.
import pandas as pd

# Create a Series with custom index
s = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

# Display original series
print("Original Series:")
print(s)

# Accessing elements
print("\nElement at index 'c':", s['c'])

# Vectorized arithmetic operation (add 5 to each element)
print("\nSeries after adding 5:")
print(s + 5)

# Filtering elements greater than 25
print("\nElements greater than 25:")
print(s[s > 25])

Original Series:
a    10
b    20
c    30
d    40
e    50
dtype: int64

Element at index 'c': 30

Series after adding 5:
a    15
b    25
c    35
d    45
e    55
dtype: int64

Elements greater than 25:
c    30
d    40
e    50
dtype: int64

In [106]:
import pandas as pd

# ------------------------------------------------------------------------------
# üßÆ Series Arithmetic - Matching Indexes
# ------------------------------------------------------------------------------

# Two Series with exactly matching indexes
s1_match = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s2_match = pd.Series([1, 2, 3], index=['a', 'b', 'c'])



# Arithmetic operations
print("\nAddition:")
print(s1_match + s2_match)

print("\nSubtraction:")
print(s1_match - s2_match)

print("\nMultiplication:")
print(s1_match * s2_match)

print("\nDivision:")
print(s1_match / s2_match)


# ------------------------------------------------------------------------------
# ‚ö†Ô∏è Series Arithmetic - Non-Matching Indexes
# ------------------------------------------------------------------------------

# Two Series with different indexes (partial overlap)
s1_mismatch = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s2_mismatch = pd.Series([1, 2, 3], index=['b', 'c', 'd'])



# Arithmetic operations result in NaN for unmatched indexes
print("\nAddition:")
print(s1_mismatch + s2_mismatch)

print("\nSubtraction:")
print(s1_mismatch - s2_mismatch)

print("\nMultiplication:")
print(s1_mismatch * s2_mismatch)

print("\nDivision:")
print(s1_mismatch / s2_mismatch)

# Using fill_value to handle NaNs by treating missing as 0
print("\nAddition with fill_value=0:")
print(s1_mismatch.add(s2_mismatch, fill_value=0))

Addition:
a    11
b    22
c    33
dtype: int64

Subtraction:
a     9
b    18
c    27
dtype: int64

Multiplication:
a    10
b    40
c    90
dtype: int64

Division:
a    10.0
b    10.0
c    10.0
dtype: float64

Addition:
a     NaN
b    21.0
c    32.0
d     NaN
dtype: float64

Subtraction:
a     NaN
b    19.0
c    28.0
d     NaN
dtype: float64

Multiplication:
a     NaN
b    20.0
c    60.0
d     NaN
dtype: float64

Division:
a     NaN
b    20.0
c    15.0
d     NaN
dtype: float64

Addition with fill_value=0:
a    10.0
b    21.0
c    32.0
d     3.0
dtype: float64

In [107]:
# ------------------------------------------------------------------------------
# Explanation of Statistical Functions in Pandas Series
# ------------------------------------------------------------------------------

# sum(): 
#   Returns the sum of all elements in the Series.

# mean(): 
#   Returns the average (mean) of the elements in the Series.

# median(): 
#   Returns the median (middle value when sorted) of the elements in the Series.

# std(): 
#   Returns the standard deviation, which shows how spread out the values are in the Series.

# var(): 
#   Returns the variance, which is the square of the standard deviation of the Series.

# min(): 
#   Returns the smallest element in the Series.

# max(): 
#   Returns the largest element in the Series.

# count(): 
#   Returns the number of non-null elements in the Series.

# describe(): 
#   Provides a summary of the Series with key statistics:
#   - count: Number of non-null elements
#   - mean: Average of the elements
#   - std: Standard deviation
#   - min: Minimum value
#   - 25%: 25th percentile
#   - 50%: Median (50th percentile)
#   - 75%: 75th percentile
#   - max: Maximum value
# ------------------------------------------------------------------------------

In [108]:
import pandas as pd

# ------------------------------------------------------------------------------
# Creating a Series for Statistical Operations
# ------------------------------------------------------------------------------

# Create a simple Series
s = pd.Series([10, 20, 30, 40, 50])

print("Series:")
print(s)

# ------------------------------------------------------------------------------
# Statistical Operations on Series
# ------------------------------------------------------------------------------

# Sum of the elements
sum_val = s.sum()
print("\nSum of Series:", sum_val)

# Mean (average) of the elements
mean_val = s.mean()
print("Mean of Series:", mean_val)

# Median of the elements
median_val = s.median()
print("Median of Series:", median_val)

# Standard deviation of the elements
std_dev = s.std()
print("Standard Deviation of Series:", std_dev)

# Variance of the elements
variance_val = s.var()
print("Variance of Series:", variance_val)

# Minimum value in the Series
min_val = s.min()
print("Minimum value of Series:", min_val)

# Maximum value in the Series
max_val = s.max()
print("Maximum value of Series:", max_val)

# Count of non-null elements
count_val = s.count()
print("Count of non-null elements in Series:", count_val)

# Description of basic statistical properties
print("\nDescription of Series:")
print(s.describe())

Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

Sum of Series: 150
Mean of Series: 30.0
Median of Series: 30.0
Standard Deviation of Series: 15.811388300841896
Variance of Series: 250.0
Minimum value of Series: 10
Maximum value of Series: 50
Count of non-null elements in Series: 5

Description of Series:
count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

<h1>Lambda Function in Series

In [109]:
import pandas as pd

# Create a Series
s = pd.Series([10, 20, 30, 40, 50])

# Apply a lambda function to each element: multiply each value by 2
result = s.apply(lambda x: x * 2)

print("Original Series:")
print(s)

print("\nSeries after applying lambda function (x * 2):")
print(result)

Original Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

Series after applying lambda function (x * 2):
0     20
1     40
2     60
3     80
4    100
dtype: int64

In [110]:
# Create a Series
s = pd.Series([10, 20, 30, 40, 50])

# Apply a lambda function to categorize the numbers
result = s.apply(lambda x: 'High' if x > 30 else 'Low')

print("\nSeries with conditional categories (High/Low):")
print(result)

Series with conditional categories (High/Low):
0     Low
1     Low
2     Low
3    High
4    High
dtype: object

In [111]:
# Create a Series
s = pd.Series([10, 20, 30, 40, 50])

# Map function with a lambda that adds 5 to each element
result = s.map(lambda x: x + 5)

print("\nSeries after using map with lambda (x + 5):")
print(result)

Series after using map with lambda (x + 5):
0    15
1    25
2    35
3    45
4    55
dtype: int64

Reading CSV

In [112]:
iris = pd.read_csv('C:/Users/bened/Documents/Alyster Coding/CODING/AIML/Datasets/iris/Iris.csv')

In [113]:
type(iris)

pandas.core.frame.DataFrame

In [114]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [115]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [116]:
iris.tail()
#last 5 values of the dataset

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [117]:
iris.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [118]:
iris.index

RangeIndex(start=0, stop=150, step=1)

In [119]:
iris.columns = ['ID','Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width', 'Species']

In [120]:
iris.columns

Index(['ID', 'Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width',
       'Species'],
      dtype='object')

In [121]:
iris.Sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [122]:
iris[['Petal_Length', 'Petal_Width']]

     Petal_Length  Petal_Width
0             1.4          0.2
1             1.4          0.2
2             1.3          0.2
3             1.5          0.2
4             1.4          0.2
..            ...          ...
145           5.2          2.3
146           5.0          1.9
147           5.2          2.0
148           5.4          2.3
149           5.1          1.8

[150 rows x 2 columns]

In [123]:
import pandas as pd

# Original Series with default index
s = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
print("Original Series:")
print(s)

# Change index names
s.index = ['x', 'y', 'z']
print("\nSeries with Changed Index Names:")
print(s)

Original Series:
a    100
b    200
c    300
dtype: int64

Series with Changed Index Names:
x    100
y    200
z    300
dtype: int64

In [124]:
#inplace is used to change the original series else it will create a new series

s.rename(index={'x': 'first', 'y': 'second', 'z': 'third'}, inplace=True)
print("\nSeries with Renamed Index:")
print(s)

Series with Renamed Index:
first     100
second    200
third     300
dtype: int64

In [125]:
import pandas as pd

# Create a simple DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

print("Original DataFrame:")
print(df)

# Rename columns
df.rename(columns={'A': 'Column1', 'B': 'Column2'}, inplace=True)
print("\nDataFrame with Renamed Columns:")
print(df)

Original DataFrame:
   A  B
0  1  4
1  2  5
2  3  6

DataFrame with Renamed Columns:
   Column1  Column2
0        1        4
1        2        5
2        3        6

In [126]:
exam_data={'math':[90,80,70],'eng':[60,70,80],'science':[50,60,70],'music':[40,50,60]}
exam_data

{'math': [90, 80, 70],
 'eng': [60, 70, 80],
 'science': [50, 60, 70],
 'music': [40, 50, 60]}

In [127]:
df=pd.DataFrame(exam_data,index=['student1','student2','student3'])
df

          math  eng  science  music
student1    90   60       50     40
student2    80   70       60     50
student3    70   80       70     60

In [128]:
df2=df[:] #copying the dataframe to another variable

df2.drop('student2',inplace=True)

C:\Users\bened\AppData\Local\Temp\ipykernel_21276\3313300988.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('student2',inplace=True)

In [129]:
df2

          math  eng  science  music
student1    90   60       50     40
student3    70   80       70     60

In [130]:
df #original reamins the same

          math  eng  science  music
student1    90   60       50     40
student2    80   70       60     50
student3    70   80       70     60

In [131]:
df3=df[:]
df3.drop('math',axis=1,inplace=True) #axis=1 means column
df3

C:\Users\bened\AppData\Local\Temp\ipykernel_21276\4189660246.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('math',axis=1,inplace=True) #axis=1 means column

          eng  science  music
student1   60       50     40
student2   70       60     50
student3   80       70     60

In [132]:
df #original remains the same

          math  eng  science  music
student1    90   60       50     40
student2    80   70       60     50
student3    70   80       70     60

In [133]:
#use the loc method to access a row by label
#use the iloc method to access a row by position
#loc is used to access a group of rows and columns by labels or a boolean array
#iloc is used to access a group of rows and columns by integer position(s)
label1=df.loc['student1']
position1=df.iloc[0]

In [134]:
label1

math       90
eng        60
science    50
music      40
Name: student1, dtype: int64

In [135]:
position1

math       90
eng        60
science    50
music      40
Name: student1, dtype: int64

In [136]:
label2=df.loc[['student1','student2']] #accessing multiple rows

In [137]:
label2

          math  eng  science  music
student1    90   60       50     40
student2    80   70       60     50

In [138]:
position2=df.iloc[[0,1]]

In [139]:
position2

          math  eng  science  music
student1    90   60       50     40
student2    80   70       60     50

Selecting COlumns

In [140]:
english=df.eng #accessing a column
english

student1    60
student2    70
student3    80
Name: eng, dtype: int64

In [141]:
music_sci=df[['music','science']]#accessing multiple columns
music_sci

          music  science
student1     40       50
student2     50       60
student3     60       70

Adding Columns

In [142]:
df['kor']=[80,90,100]
df

          math  eng  science  music  kor
student1    90   60       50     40   80
student2    80   70       60     50   90
student3    70   80       70     60  100

Adding Rows

In [143]:
df.loc[3]=[38 , 98,56,45,78]
df

          math  eng  science  music  kor
student1    90   60       50     40   80
student2    80   70       60     50   90
student3    70   80       70     60  100
3           38   98       56     45   78

In [144]:
df.index=['student1','student2','student3','student4']
df

          math  eng  science  music  kor
student1    90   60       50     40   80
student2    80   70       60     50   90
student3    70   80       70     60  100
student4    38   98       56     45   78

Setting a column as an index

In [145]:
df['name']=['alvin','alex','tanay','alyster']
df.set_index('name',inplace=True)
df

         math  eng  science  music  kor
name
alvin      90   60       50     40   80
alex       80   70       60     50   90
tanay      70   80       70     60  100
alyster    38   98       56     45   78

Changing the dataframe Element

In [146]:
df.iloc[0,1]=100
df

         math  eng  science  music  kor
name
alvin      90  100       50     40   80
alex       80   70       60     50   90
tanay      70   80       70     60  100
alyster    38   98       56     45   78

In [147]:
df.loc['alvin','math']=100
df

         math  eng  science  music  kor
name
alvin     100  100       50     40   80
alex       80   70       60     50   90
tanay      70   80       70     60  100
alyster    38   98       56     45   78

In [148]:
df.reset_index(inplace=True)
df

      name  math  eng  science  music  kor
0    alvin   100  100       50     40   80
1     alex    80   70       60     50   90
2    tanay    70   80       70     60  100
3  alyster    38   98       56     45   78

Transpose

In [149]:
dff=df.transpose()
dff

             0     1      2        3
name     alvin  alex  tanay  alyster
math       100    80     70       38
eng        100    70     80       98
science     50    60     70       56
music       40    50     60       45
kor         80    90    100       78

In [150]:
dfff=dff.T
dfff

      name math  eng science music  kor
0    alvin  100  100      50    40   80
1     alex   80   70      60    50   90
2    tanay   70   80      70    60  100
3  alyster   38   98      56    45   78

Multiple Index

In [151]:
import pandas as pd

# Original DataFrame
dfm = pd.DataFrame({
    'name': ['alvin', 'alex', 'tanay', 'alyster'],
    'math': [100, 80, 70, 38],
    'eng': [100, 70, 80, 98],
    'science': [50, 60, 70, 56],
    'music': [40, 50, 60, 45],
    'kor': [80, 90, 100, 78],
    'age': [15, 16, 15, 17]
})

# Create a new DataFrame with MultiIndex
df_multi = dfm.set_index(['name', 'age'])

# Show the new DataFrame
print(df_multi)

             math  eng  science  music  kor
name    age
alvin   15    100  100       50     40   80
alex    16     80   70       60     50   90
tanay   15     70   80       70     60  100
alyster 17     38   98       56     45   78

Sort Index

In [152]:
df_multi.sort_index(inplace=True) #sort the index in ascending order
df_multi

             math  eng  science  music  kor
name    age
alex    16     80   70       60     50   90
alvin   15    100  100       50     40   80
alyster 17     38   98       56     45   78
tanay   15     70   80       70     60  100

Sorting wr to a particular column

In [153]:
df_multi.sort_index(level='age',ascending=True,inplace=True)
df_multi

             math  eng  science  music  kor
name    age
alvin   15    100  100       50     40   80
tanay   15     70   80       70     60  100
alex    16     80   70       60     50   90
alyster 17     38   98       56     45   78

Descending order

In [154]:
df_multi.sort_index(level='age',ascending=False,inplace=True)
df_multi

             math  eng  science  music  kor
name    age
alyster 17     38   98       56     45   78
alex    16     80   70       60     50   90
tanay   15     70   80       70     60  100
alvin   15    100  100       50     40   80

<h1>Series Operations

series operations applies to every element of the series and returns the resultant

In [155]:
import numpy as np

In [156]:
student1=pd.Series({'kor':100,'eng':80,'math':90,'science':70,'music':60})
student1

kor        100
eng         80
math        90
science     70
music       60
dtype: int64

In [157]:
percentage=student1/200
percentage

kor        0.50
eng        0.40
math       0.45
science    0.35
music      0.30
dtype: float64

In [158]:
student2=pd.Series({'eng':80,'math':90,'science':70,'kor':100,'music':60})

addition=student1+student2
sub=student1-student2
mul=student1*student2
div=student1/student2

In [159]:
print(f'add {addition} \n sub {sub} \n mul {mul} \n div {div}')

add eng        160
kor        200
math       180
music      120
science    140
dtype: int64
 sub eng        0
kor        0
math       0
music      0
science    0
dtype: int64
 mul eng         6400
kor        10000
math        8100
music       3600
science     4900
dtype: int64
 div eng        1.0
kor        1.0
math       1.0
music      1.0
science    1.0
dtype: float64

In [160]:
result=pd.DataFrame([addition,sub,mul,div],index=['addition','subtraction','multiplication','division'])
result
#combining the results of series into a dataframe

                   eng      kor    math   music  science
addition         160.0    200.0   180.0   120.0    140.0
subtraction        0.0      0.0     0.0     0.0      0.0
multiplication  6400.0  10000.0  8100.0  3600.0   4900.0
division           1.0      1.0     1.0     1.0      1.0

with missing values

In [161]:
student3=pd.Series({'eng':80,'math':90,'science':70,'music':60})
addition=student1+student3
sub=student1-student3
mul=student1*student3
div=student1/student3
result3=pd.DataFrame([addition,sub,mul,div],index=['addition','subtraction','multiplication','division'])
result3

                   eng  kor    math   music  science
addition         160.0  NaN   180.0   120.0    140.0
subtraction        0.0  NaN     0.0     0.0      0.0
multiplication  6400.0  NaN  8100.0  3600.0   4900.0
division           1.0  NaN     1.0     1.0      1.0

to remove the Nan , use the Operation Method

In [162]:
sr_add=student1.add(student3,fill_value=0) #adding the two series

In [163]:
sr_sub=student1.sub(student3,fill_value=0) #subing the two series

In [164]:
sr_div=student1.div(student3,fill_value=0) #diving the two series

In [165]:
sr_mul=student1.mul(student3,fill_value=0) #muling the two series

In [166]:
result4=pd.DataFrame([sr_add,sr_sub,sr_mul,sr_div],index=['addition','subtraction','multiplication','division'])
result4

                   eng    kor    math   music  science
addition         160.0  100.0   180.0   120.0    140.0
subtraction        0.0  100.0     0.0     0.0      0.0
multiplication  6400.0    0.0  8100.0  3600.0   4900.0
division           1.0    inf     1.0     1.0      1.0

<h1>DataFrame Operations

In [167]:
import seaborn as sns
iris=sns.load_dataset('iris')

In [168]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [169]:
#selecting specific columns from the irirs dataset
df=iris.loc[:,['sepal_length','sepal_width']]  #all rows and specific columns
df.head()

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

while maintaining the form of the existing dataframe , only the element value is replaced with a new
calculated value and returned as a new DataFrame object

In [170]:
addition=df+10
addition.head()

   sepal_length  sepal_width
0          15.1         13.5
1          14.9         13.0
2          14.7         13.2
3          14.6         13.1
4          15.0         13.6

In [171]:
subtraction=df-10
subtraction.iloc[50:100]

    sepal_length  sepal_width
50          -3.0         -6.8
51          -3.6         -6.8
52          -3.1         -6.9
53          -4.5         -7.7
54          -3.5         -7.2
55          -4.3         -7.2
56          -3.7         -6.7
57          -5.1         -7.6
58          -3.4         -7.1
59          -4.8         -7.3
60          -5.0         -8.0
61          -4.1         -7.0
62          -4.0         -7.8
63          -3.9         -7.1
64          -4.4         -7.1
65          -3.3         -6.9
66          -4.4         -7.0
67          -4.2         -7.3
68          -3.8         -7.8
69          -4.4         -7.5
70          -4.1         -6.8
71          -3.9         -7.2
72          -3.7         -7.5
73          -3.9         -7.2
74          -3.6         -7.1
75          -3.4         -7.0
76          -3.2         -7.2
77          -3.3         -7.0
78          -4.0         -7.1
79          -4.3         -7.4
80          -4.5         -7.6
81          -4.5         -7.6
82          -4.2         -7.3
83          -4.0         -7.3
84          -4.6         -7.0
85          -4.0         -6.6
86          -3.3         -6.9
87          -3.7         -7.7
88          -4.4         -7.0
89          -4.5         -7.5
90          -4.5         -7.4
91          -3.9         -7.0
92          -4.2         -7.4
93          -5.0         -7.7
94          -4.4         -7.3
95          -4.3         -7.0
96          -4.3         -7.1
97          -3.8         -7.1
98          -4.9         -7.5
99          -4.3         -7.2

If a value is missing ,Nan is used inplace of the result of the arithmetic operation

<h1>Merging and Binding dataframes

In [175]:
import pandas as pd


# Personal Information DataFrame
df_personal = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Grace', 'Hannah'],
    'gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Female'],
    'age': [25, 30, 28, 35, 32, 29]
})

# Job Information DataFrame
df_job = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Eve', 'Frank', 'Grace', 'Ivan'],
    'position': ['Engineer', 'Manager', 'Analyst', 'Designer', 'HR', 'Technician'],
    'wage': [75000, 85000, 62000, 70000, 68000, 72000]
})

In [176]:
inner=df_personal.merge(df_job, on='name', how='inner')
outer=df_personal.merge(df_job, on='name', how='outer')
right=df_personal.merge(df_job, on='name', how='right')
left=df_personal.merge(df_job, on='name', how='left')

print("Inner join:\n",inner,"\n")
print("Outer join:\n",outer,"\n")
print("left join:\n",left,"\n")
print("right join:\n",right,"\n")

Inner join:
     name  gender  age  position   wage
0  Alice  Female   25  Engineer  75000
1    Bob    Male   30   Manager  85000
2  Grace  Female   32        HR  68000

Outer join:
       name  gender   age    position     wage
0    Alice  Female  25.0    Engineer  75000.0
1      Bob    Male  30.0     Manager  85000.0
2  Charlie    Male  28.0         NaN      NaN
3    David    Male  35.0         NaN      NaN
4      Eve     NaN   NaN     Analyst  62000.0
5    Frank     NaN   NaN    Designer  70000.0
6    Grace  Female  32.0          HR  68000.0
7   Hannah  Female  29.0         NaN      NaN
8     Ivan     NaN   NaN  Technician  72000.0

left join:
       name  gender  age  position     wage
0    Alice  Female   25  Engineer  75000.0
1      Bob    Male   30   Manager  85000.0
2  Charlie    Male   28       NaN      NaN
3    David    Male   35       NaN      NaN
4    Grace  Female   32        HR  68000.0
5   Hannah  Female   29       NaN      NaN

right join:
     name  gender   age    position   wage
0  Alice  Female  25.0    Engineer  75000
1    Bob    Male  30.0     Manager  85000
2    Eve     NaN   NaN     Analyst  62000
3  Frank     NaN   NaN    Designer  70000
4  Grace  Female  32.0          HR  68000
5   Ivan     NaN   NaN  Technician  72000

Concat

In [ ]:
#bind vertically by matching the column names

pd.concat([df_personal,df_job],axis=0) #concatenating the two dataframes

      name  gender   age    position     wage
0    Alice  Female  25.0         NaN      NaN
1      Bob    Male  30.0         NaN      NaN
2  Charlie    Male  28.0         NaN      NaN
3    David    Male  35.0         NaN      NaN
4    Grace  Female  32.0         NaN      NaN
5   Hannah  Female  29.0         NaN      NaN
0    Alice     NaN   NaN    Engineer  75000.0
1      Bob     NaN   NaN     Manager  85000.0
2      Eve     NaN   NaN     Analyst  62000.0
3    Frank     NaN   NaN    Designer  70000.0
4    Grace     NaN   NaN          HR  68000.0
5     Ivan     NaN   NaN  Technician  72000.0

In [ ]:
#bind horizontally by matching the indices
pd.concat([df_personal,df_job],axis=1) #concatenating the two dataframes

      name  gender  age   name    position   wage
0    Alice  Female   25  Alice    Engineer  75000
1      Bob    Male   30    Bob     Manager  85000
2  Charlie    Male   28    Eve     Analyst  62000
3    David    Male   35  Frank    Designer  70000
4    Grace  Female   32  Grace          HR  68000
5   Hannah  Female   29   Ivan  Technician  72000